In [1]:
import pandas as pd
import numpy as np

### Removing Duplicates

In [2]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4, 
                     'k2': [1, 1, 2, 2, 3, 3, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   2
4  two   3
5  two   3
6  two   4

In [3]:
data.duplicated()

0    False
1     True
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [4]:
data.drop_duplicates()  # consider all columns if they are all duplicates

    k1  k2
0  one   1
2  one   2
3  two   2
4  two   3
6  two   4

In [5]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   2   3
4  two   3   4
5  two   3   5
6  two   4   6

In [6]:
data.drop_duplicates(['k1'])  # consider one column

    k1  k2  v1
0  one   1   0
3  two   2   3

In [7]:
data.drop_duplicates(['k1', 'k2'])  # consider two columns

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   2   3
4  two   3   4
6  two   4   6

In [8]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
1  one   1   1
2  one   2   2
3  two   2   3
5  two   3   5
6  two   4   6

### Transforming Data Using a Function or Mapping

In [9]:
data_1 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 
                             'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data_1

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [10]:
meat_to_animal = { 'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 
                  'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

data_1['animal'] = data_1['food'].map(str.lower).map(meat_to_animal)
# or data['food'].map(lambda x: meat_to_animal[x.lower()])

data_1

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values

In [11]:
data_3 = pd.Series([1., -999., 2., -999., -1000., 3.])

In [12]:
data_3

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [13]:
data_3.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [14]:
data_3.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [15]:
data_3.replace({-999: np.nan, -1000: 1})

0    1.0
1    NaN
2    2.0
3    NaN
4    1.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [17]:
data_4 = pd.DataFrame(np.arange(12).reshape(3, 4), 
                      index = ['Ohio', 'Colorado', 'New York'], 
                      columns = ['one', 'two', 'three', 'four'])
data_4

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [28]:
data_4.index = data_4.index.map(str.upper)
data_4

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [29]:
data_4.rename(index = {'OHIO': 'INDIANA'}, columns = {'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [30]:
data_4.rename(index = str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [31]:
data_4  # because inplace is False in default, rename didn't modify the original df

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

### Discretization and Binning

In [32]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [34]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [38]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [36]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [37]:
pd.cut(ages, bins, right = False)  # include left but right

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [39]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [MiddleAged < Senior < YoungAdult < Youth]

In [40]:
data_5 = np.random.rand(20)
data_5

array([ 0.62635098,  0.69321008,  0.86185847,  0.3235094 ,  0.38437844,
        0.72878043,  0.4188734 ,  0.01856859,  0.27951035,  0.68997371,
        0.6370299 ,  0.34092405,  0.45237134,  0.08118229,  0.82407869,
        0.31693039,  0.38163978,  0.6574843 ,  0.08614713,  0.06884178])

In [41]:
pd.cut(data_5, 4, precision = 2)

[(0.44, 0.65], (0.65, 0.86], (0.65, 0.86], (0.23, 0.44], (0.23, 0.44], ..., (0.23, 0.44], (0.23, 0.44], (0.65, 0.86], (0.018, 0.23], (0.018, 0.23]]
Length: 20
Categories (4, interval[float64]): [(0.018, 0.23] < (0.23, 0.44] < (0.44, 0.65] < (0.65, 0.86]]

### Detecting and Filtering Outliers

In [2]:
data_6 = pd.DataFrame(np.random.randn(1000, 4))
data_6.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.074991    -0.012414    -0.037225     0.051991
std       1.020292     1.021994     0.968982     0.995781
min      -3.762568    -3.497562    -2.697341    -2.780489
25%      -0.591610    -0.699877    -0.710674    -0.659528
50%       0.114432    -0.038057    -0.087572     0.033746
75%       0.746877     0.688703     0.616726     0.758541
max       3.114425     3.438084     2.943504     2.882138

In [6]:
col = data_6[3]
col[np.abs(col) > 2.5]

9      2.620680
64     2.800714
133    2.547229
210   -2.597782
370    2.683048
407   -2.546385
514    2.501104
613    2.516652
618   -2.780489
659    2.882138
675    2.804023
983    2.518187
Name: 3, dtype: float64

In [8]:
data_6[(np.abs(data_6) > 3).any(1)]

            0         1         2         3
27  -0.575087  3.084150  1.440201  1.610802
482  0.180160  3.130251 -1.391855  1.969885
534 -1.154301  3.438084  0.704574  1.470224
565  0.896773 -3.298317  2.445490 -0.137059
593 -3.454060 -0.261412 -0.561187 -0.314812
632  3.114425  1.371145  0.046542  1.826728
669  0.602393 -3.497562  1.261129  0.623846
681 -1.161750 -3.029269 -0.067203  1.409391
981 -3.762568  0.278192 -1.234656 -0.237798

### Permutation and Random Sampling